# 175987
# 9870
# 590



    
#str1 = input("문자를 입력하세요.")
#a = len(str1) #len = 문자의 길이.length
##a = int(input("숫자를 입력하세요."))
#if a==5:
#  print("a는 5입니다.")
#elif a==4:  # elif = else if
#  print("a는 4입니다.")
#elif a==3:
#  print("a는 3입니다.")
#else:
#  print("a 숫자는 2 이하입니다.")



# money = 175987
# #50000,10000,5000,1000,500,100,50,10
# print("50,000원 갯수 : ",money//50000,"개")
# print("10,000원 갯수 : ",(money%50000)//10000,"개")
# print("5,000원 갯수 : ",(money%50000)%10000//5000,"개")
# print("1,000원 갯수 : ",((money%50000)%10000)%5000//1000,"개")
# print("500원 갯수 : ",(((money%50000)%10000)%5000)%1000//500,"개")
# print("100원 갯수 : ",((((money%50000)%10000)%5000)%1000)%500//100,"개")
# print("50원 갯수 : ",(((((money%50000)%10000)%5000)%1000)%500)%100//50,"개")
# print("10원 갯수 : ",((((((money%50000)%10000)%5000)%1000)%500)%100)%50//10,"개")
# print("1원 갯수 : ",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)%10//1,"개")


# money = 780
# # 500 - 1개
# print("500원 동전 갯수 : ",money//500)
# # 100 - 2개
# print("100원 동전 갯수 : ",(money%500)//100)
# # 50 - 1개
# print("50원 동전 갯수 : ",((money%500)%100)//50)
# # 10 - 3개
# print("10원 동전 갯수 : ",(((money%500)%100)%50)//10)

